Revit 2026 API
ElementParameterFilter Constructor
Overload List
Name | Description
ElementParameterFilter(FilterRule) |  Constructs a new instance of an ElementParameterFilter from a single rule.
ElementParameterFilter(IList<FilterRule>) | Initializes a new instance of the ElementParameterFilter class
ElementParameterFilter(FilterRule, Boolean) |  Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule.
ElementParameterFilter(IList<FilterRule>, Boolean) | Initializes a new instance of the ElementParameterFilter class
Top
See Also
Reference
ElementParameterFilter Class
Autodesk.Revit.DB Namespace